package rpg.server.core.event;

public enum GameEventType {

	// ********************************************
	// ******地图相关
	// ********************************************
	/** 离开场景 */
	STAGE_LEAVE,
	/** 进入场景 */
	STAGE_ENTER,
	/** 移动 */
	STAGE_MOVE,
	/** 回城 */
	STAGE_HOME,
	/** 发现邻居 */
	STAGE_NEIGHBOR_DISCOVER,
	/** 删除邻居 */
	STAGE_NEIGHBOR_REMOVE,
	// ********************************************
	// ******角色相关
	// ********************************************
	/** 升级 */
	PLAYER_LEVELUP,
	/** 用户下线 */
	PLAYER_LOGOUT,
	/** 血魔更新 */
	PLAYER_HPMP_CHANGE,
	/** 上线 */
	PLAYER_LOGIN,
	/** 重新上线 */
	PLAYER_RELOGIN,
	/** 加载成功 */
	PLAYER_LOAD_SUCCESS,
	// ********************************************
	// ******客户端相关
	// ********************************************
	/** 客户端发来的心跳包 */
	CLIENT_HEARTBEAT,

	// ********************************************
	// ******战斗相关
	// ********************************************
	/** 复活 */
	BATTLE_RELIVE,
	/** 战斗开始 */
	BATTLE_BEGIN,
	/** 战斗结束 */
	BATTLE_END,
	// ********************************************
	// ****** 物品相关
	// ********************************************
	/** 添加物品 */
	ITEM_ADD,
	/** 删除物品 */
	ITEM_REMOVE,
	/** 使用物品 */
	ITEM_USE,
	// ********************************************
	// ****** 技能相关
	// ********************************************
	/** 使用技能 */
	SKILL_USE,

	// ********************************************
	// ****** Team相关
	// ********************************************
	/** 加入小队 */
	TEAM_JOIN,
	/** 离开队伍 */
	TEAM_LEAVE,
	/** 队伍解散 */
	TEAM_DISMISS,
	// ********************************************
	// ****** 好友相关
	// ********************************************
	/** 添加好友 */
	BUDDY_ADD,
	/** 删除好友 */
	BUDDY_DEL,

	// ********************************************
	// ****** NPC相关
	// ********************************************
	/** NPC喊话 */
	NPC_TALK,
	// ********************************************
	// ****** 任务相关
	// ********************************************
	/** 任务完成,未交还 */
	QUEST_FINISH,
	/** 交还任务 */
	QUEST_TURN,
	/** 接受任务 */
	QUEST_ACCEPTED,
	/** 取消任务 */
	QUEST_CANCEL,
	/** 任务失败 */
	QUEST_FAIL,

	// ********************************************
	// ****** 家族相关
	// ********************************************
	/** 玩家加入家族 */
	FAMILY_JOIN,
	/** 玩家离开家族 */
	FAMILY_LEAVE,
	/** 创建家族 */
	FAMILY_CREATE,

	// ********************************************
	// ****** 充值
	// ********************************************
	/** 充值成功 */
	CHARGE_SUCC,
}
